print("Task 1-3")
alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n'
                       '"That depends a good deal on where you want to get to," said the Cat.\n'
                       '"I don\'t much care where ——" said Alice.\n'
                       '"Then it doesn\'t matter which way you go," said the Cat.\n'
                       '"—— so long as I get somewhere," Alice added as an explanation.\n'
                       '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."')
print(alice_in_wonderland)
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
print("--------")
print("Task 4")
black_sea_sq = 436402
azov_sea_sq = 37800
print(f"Площа Чорного моря: {black_sea_sq} км2\n"
      f"Площа Азовського моря: {azov_sea_sq} км2\n"
      f"Загальна площа Чорного і Азовського морів: {black_sea_sq+azov_sea_sq} км2")

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
print("--------")
print("Task 5")
total_goods = 375291
goods_1_and_2 = 250449
goods_2_and_3 = 222950
first_wh = total_goods - goods_2_and_3
third_wh = total_goods - goods_1_and_2
second_wh = total_goods - first_wh - third_wh
print(f"Товарів загалом: {total_goods}\n"
      f"Товарів на першому складі: {first_wh}\n"
      f"Товарів на другому складі: {second_wh}\n"
      f"Товарів на третьому складі: {third_wh}\n")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
print("--------")
print("Task 6")
month_payment = 1179
month_number = 18
print(f"Загальна ціна комп'ютера при оплаті {month_payment} грн/міс за {month_number} місяців: {month_payment*month_number} грн")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
print("--------")
print("Task 7")
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print(f"Остача від ділення чисел:\n"
      f"a) 8019 : 8 = {int(8019/8)}({a})\n"
      f"b) 9907 : 9 = {int(9907/9)}({b})\n"
      f"c) 2789 : 5 = {int(2789/5)}({c})\n"
      f"d) 7248 : 6 = {int(7248/6)}({d})\n"
      f"e) 7128 : 5 = {int(7128/5)}({e})\n"
      f"f) 19224 : 9 = {int(19224/9)}({f})\n")

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
print("--------")
print("Task 8")
goods = [274, 218, 35, 350, 21]
num = [4, 2, 4, 1, 3]
print(f"Сума грошей для покупок Іринки: {goods[0]*num[0]+goods[1]*num[1]+goods[2]*num[2]+goods[3]*num[3]+goods[4]*num[4]} грн")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
print("--------")
print("Task 9")
photos = 232
if (photos % 8) == 0:
    print(f"Ігору знадобиться {photos//8} сторінок альбома")
if (photos % 8) > 0:
    print(f"Ігору знадобиться {int(photos/8)+1} сторінок альбома")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
print("--------")
print("Task 10")
total_dist = 1600
dist100 = 100
litre_on_100 = 9
litre_on_tank = 48
stops = ((total_dist / dist100) * litre_on_100) / litre_on_tank
if int(stops) == (stops):
    print(int(stops-1))
if int(stops) != (stops):
    print(int(stops))